Reports/ДействующиеАкцииПоТоварам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>ДействующиеАкцииПоТоварам</Name>
		</Properties>
	</Report>
</MetaDataObject>

Catalogs/АналогиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>АналогиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПредставлениеТоваров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>id_tov_vz</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолностьюЗаменяемыйТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/ДействующиеАкцииПоТоварам/Forms/АнализПолныхАналогов/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТекДата", НачалоДня(ТекущаяДата()));
	Запрос.Текст = "ВЫБРАТЬ
	               |	АналогиНоменклатурыТовары.Номенклатура,
	               |	АналогиНоменклатурыТовары.Ссылка КАК АналогиСсылка
	               |ПОМЕСТИТЬ ВТ_ТоварыАналогов
	               |ИЗ
	               |	Справочник.АналогиНоменклатуры.Товары КАК АналогиНоменклатурыТовары
	               |ГДЕ
	               |	АналогиНоменклатурыТовары.Ссылка.ПолностьюЗаменяемыйТовар = ИСТИНА
	               |	И АналогиНоменклатурыТовары.Номенклатура.ПометкаУдаления = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_ТоварыАналогов.АналогиСсылка КАК АналогиСсылка,
	               |	ЕСТЬNULL(НоменклатураАкции.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачала,
	               |	ЕСТЬNULL(НоменклатураАкции.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОкончания,
	               |	ЕСТЬNULL(НоменклатураАкции.ПриПокупкеШтук, -1) КАК ПриПокупкеШтук,
	               |	ЕСТЬNULL(НоменклатураАкции.ДействуетЦена_Скидка, -1) КАК ДействуетЦена_Скидка
	               |ИЗ
	               |	ВТ_ТоварыАналогов КАК ВТ_ТоварыАналогов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Акции КАК НоменклатураАкции
	               |		ПО ВТ_ТоварыАналогов.Номенклатура = НоменклатураАкции.Ссылка
	               |			И (НоменклатураАкции.ДатаОкончания >= &ТекДата)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	АналогиСсылка";
	
	Результаты = Запрос.ВыполнитьПакет();
	
	ВыборкаАналоги = Результаты[1].Выбрать();
	Пока ВыборкаАналоги.СледующийПоЗначениюПоля("АналогиСсылка") Цикл
		Счетчик = 0;
		Пока ВыборкаАналоги.Следующий() Цикл
			Счетчик = Счетчик + 1;
		КонецЦикла;
		Если Счетчик > 1 Тогда
			СтрокаДоб = ТабАналоги.Добавить();
			СтрокаДоб.Аналог = ВыборкаАналоги.АналогиСсылка;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры
